; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_2 ?v8 - type_2 ?v1 - type_1)
 	      (pred_3 ?v5 - object ?v1 - type_1)
	      (pred_1 ?v8 - type_2 ?v4 - type_3)
	      (pred_4 ?v8 - type_2 ?v5 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v8 - type_2 ?v3 ?v6 - type_1)
       :precondition (and  (pred_2 ?v8 ?v3))
       :effect (and  (pred_2 ?v8 ?v6)
		     (not (pred_2 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_2 ?v2 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v2 ?v7) (pred_2 ?v8 ?v7) (pred_1 ?v8 ?v4))
       :effect (and (pred_4 ?v8 ?v2 ?v4)
		    (not (pred_3 ?v2 ?v7)) 
		    (not (pred_1 ?v8 ?v4))))

   (:action op_1
       :parameters (?v8 - type_2 ?v2 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v2 ?v4) (pred_2 ?v8 ?v7))
       :effect (and (pred_3 ?v2 ?v7)
		    (pred_1 ?v8 ?v4)
		    (not (pred_4 ?v8 ?v2 ?v4)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_09 obj_04 - type_2
obj_06 obj_13 obj_05 obj_08 - type_3
obj_03 obj_07 obj_10 obj_11 - type_1
obj_02 obj_12 obj_01 obj_14 - object)
(:init
(pred_2 obj_09 obj_10)
(pred_1 obj_09 obj_06)
(pred_1 obj_09 obj_13)
(pred_2 obj_04 obj_10)
(pred_1 obj_04 obj_05)
(pred_1 obj_04 obj_08)
(pred_3 obj_02 obj_03)
(pred_3 obj_12 obj_07)
(pred_3 obj_01 obj_10)
(pred_3 obj_14 obj_07)
)
(:goal
(and
(pred_3 obj_02 obj_03)
(pred_3 obj_12 obj_07)
(pred_3 obj_01 obj_11)
(pred_3 obj_14 obj_10)
)
)

(:constraints
  (always (not (pred_2 obj_09 obj_11)))
)
)

; plan
1. (op_3 obj_04 obj_01 obj_10 obj_08)
   deleted: (pred_3 obj_01 obj_10) (pred_1 obj_04 obj_08)
   added: (pred_4 obj_04 obj_01 obj_08)
   goals met: 2 of 4
2. (op_2 obj_09 obj_10 obj_07)
   deleted: (pred_2 obj_09 obj_10)
   added: (pred_2 obj_09 obj_07)
   goals met: 2 of 4
3. (op_2 obj_04 obj_10 obj_11)
   deleted: (pred_2 obj_04 obj_10)
   added: (pred_2 obj_04 obj_11)
   goals met: 2 of 4
4. (op_3 obj_09 obj_14 obj_07 obj_13)
   deleted: (pred_3 obj_14 obj_07) (pred_1 obj_09 obj_13)
   added: (pred_4 obj_09 obj_14 obj_13)
   goals met: 2 of 4
5. (op_1 obj_04 obj_01 obj_11 obj_08)
   deleted: (pred_4 obj_04 obj_01 obj_08)
   added: (pred_3 obj_01 obj_11) (pred_1 obj_04 obj_08)
   goals met: 3 of 4
6. (op_2 obj_09 obj_07 obj_10)
   deleted: (pred_2 obj_09 obj_07)
   added: (pred_2 obj_09 obj_10)
   goals met: 3 of 4
7. (op_1 obj_09 obj_14 obj_10 obj_13)
   deleted: (pred_4 obj_09 obj_14 obj_13)
   added: (pred_3 obj_14 obj_10) (pred_1 obj_09 obj_13)
   goals met: 4 of 4
